Repository: collective/collective.searchandreplace
Catalog: collective/searchandreplace/locales/*/LC_MESSAGES/SearchAndReplace.po
Languages: fr, nl, ru

source: Affected Content
fr: Contenu Affecté
nl: Te wijzigen inhoud
ru: Затронутое содержимое

source: After
fr: Après
nl: Na
ru: После

source: Before
fr: Avant
nl: Voor
ru: До

source: Check the box for a case sensitive search.
fr: Cochez la case pour une recherche sensible à la casse.
nl: Vink aan voor hoofdlettergevoelig zoeken.
ru: Чувствительность к регистру.

source: Enter the text to find.
fr: Entrez le texte à rechercher
nl: Vul de tekst in om naar te zoeken.
ru: Введите текст для поиска.

source: Enter the text to replace the original text with.
fr: Entrez le texte qui remplacera le texte original.
nl: Vul de tekst in om de oorspronkelijke tekst mee te vervangen.
ru: Введите текст для замены в оригинальном тексте.

source: Fast search
fr: Recherche rapide
nl: Snel zoeken
ru: Быстрый поиск

source: Find What
fr: Rechercher
nl: Zoek naar
ru: Что ищем

source: If checked, multiple lines fields like subject will also be searched and replaced, not only title and text fields.
nl: Als deze optie is aangevinkt, worden velden met meerdere lijnen (zoals Tags) ook doorzocht, niet enkel titel en tekst velden

source: If checked, only the enabled types are searched, otherwise all types are searched.
fr: Si coché, uniquement les types activés seront recherchés, sinon, tous les types sont recherchés.
nl: Als deze optie is aangevinkt, worden alleen de ingeschakelde types doorzocht, anders worden alle types doorzocht.
ru: Если отмеченон, просматриваются только выбранные типы , в противном случае просматриваются все типы.

source: If checked, single line fields will also be searched and replaced, not only title and text fields.
nl: Als deze optie is aangevinkt, worden enkele lijn velden ook doorzocht, niet enkel titel en tekst velden

source: If checked, the modified index/metadata of the object having text replaced will be updated.
nl: Als deze optie is aangevinkt, worden de index/metadata van het object waarvan tekst is vervangen bijgewerkt

source: If checked, this will recursively search through any selected folders and their children, replacing at each level.
fr: Si coché, la recherche sera faite récursivement à travers tous les dossiers et leurs enfants, remplaçant à chaque niveau.
nl: Als deze optie is aangevinkt, wordt recursief gezocht door de map en alle onderliggende mappen en items, waarbij op elk niveau vervangen wordt.
ru: Если отмечено. то ищется рекурсивно в любых выбранных папках и дочерних элементах, замена производится на каждом уровне.

source: Installs the collective.searchandreplace package
fr: Installe le paquet collective.searchandreplace
nl: Installeert het collective.searchandreplace package
ru: Поиск и замена текста в содержимом элементов. Ищет в названии, описании и в тексте документа, по всем текстовым полям.

source: Line
fr: Ligne
nl: Regel
ru: Строка

source: List of types that are searched.
fr: Liste des types qui seront recherchés.
nl: Lijst van types die doorzocht worden.
ru: Перечень типов для поиска

source: Match Case
fr: Sensible à la casse
nl: Hoofdlettergevoelig
ru: Учитывать регистр

source: Maximum Number of Results
fr: Nombre de résultats maximum
nl: Maximum aantal resultaten
ru: Максимальное количество результатов

source: Maximum number of results to show. Warning: this only affects how many preview results are shown. It has no effect on how many found texts are replaced when you use the Replace button.
nl: Maximum aantal resultaten om te tonen. Let op: dit heeft enkel effect op hoeveel resultaten getoond worden in Voorvertoning. Het heeft geen efffect op het aantal teksten dat wordt vervangen als je op de knop Vervangen drukt.

source: Maximum text characters
fr: Caractères de texte maximum
nl: Maximum aantal karakters
ru: Максимум символов.

source: Path
fr: Chemin
nl: Pad
ru: Путь

source: Preview
fr: Aperçu
nl: Voorvertoning
ru: Предварительный просмотр

source: Replace
fr: Remplacer
nl: Vervang
ru: Заменить

source: Replace With
fr: Remplacer par
nl: Vervang door
ru: Заменить на

source: Replaced: ${old} -> ${new}
fr: Remplacé: ${old} -> ${new}
nl: Vervangen: ${old} -> ${new}
ru: Заменено: ${old} -> ${new}

source: Restrict the enabled types.
fr: Restreindre les types activés.
nl: Beperkt de ingeschakelde types.
ru: Ограничиться отмеченными типами.

source: Search Subfolders
fr: Rechercher dans les sous-dossiers
nl: Doorzoek submappen
ru: Искать в подпапках

source: Search also lines fields
nl: Zoek ook in velden met lijnen

source: Search also textline fields
nl: Zoek ook in tekstvak velden

source: Search and Replace
fr: Rechercher et Remplacer
nl: Zoek en vervang
ru: Поиск и Замена

source: Search and Replace settings
fr: Paramètres de Rechercher et Remplacer
nl: Zoek en vervang-instellingen
ru: Настройки "Поиск и Замена"

source: Search and Replace text
fr: Rechercher et Remplacer du texte
nl: Zoek en vervang tekst
ru: Найти и заменить текст

source: Search and replace in parent folder
fr: Rechercher et remplacer dans le dossier parent
nl: Zoek en vervang in de bovenliggende folder
ru: Найти и заменить в родительской папке

source: Search and replace text found in documents.
fr: Recherche et remplace le texte trouvé dans les documents.
nl: Zoek en vervang tekst gevonden in documenten.
ru: Найти и заменить найденный текст в документах.

source: Search text replaced in ${replaced} of ${items} instance(s).
fr: Texte recherché remplacé dans ${replaced} de ${items} instance(s).
nl: Gezochte tekst vervangen in ${replaced} van ${items} geval(len).
ru: Заменить найденный текст на ${replaced} в ${items} экземпляре(ах).

source: Search text replaced in all ${items} instance(s).
fr: Texte recherché remplacé dans toutes les ${items} instance(s).
nl: Gezochte tekst vervangen in alle ${items} geval(len).
ru: Заменить найденный текст во всех ${items} экземплярах

source: Search/Replace
fr: Rechercher/Remplacer
nl: Zoek/Vervang
ru: Поиск/Замена

source: Select all items
fr: Tout sélectionner
nl: Selecteer alle items
ru: Выбрать все элементы

source: The maximum number of characters to show before and after the found text.
fr: Le nombre maximum de caractères à afficher avant et après le texte trouvé.
nl: Maximum aantal karakters om te tonen voor en na de gevonden tekst.
ru: Максимальное количество символов, которые будет показаны до и после найденного текста.

source: Update the modified datetime when replacing.
nl: Werk de wijzigingsdatum bij na vervanging.

source: Use the catalog to search, just like the search form does. This only finds keywords, not html tags. You might have some text fields that are not found this way, so if not checked, you may find more content, but it will be slower. Regardless of this setting, when at least one match is found, text in all text fields may be replaced.
fr: Utilise le catalogue pour rechercher, comme le fait le formulaire de recherche. Cela permet uniquement de trouver des mots-clés, et non des tags HTML. Vous pouvez avoir certains champs texte qui ne seront pas trouvés de cette facon, vous pourrez donc trouver plus de contenus si non coché, mais cela sera plus lent. Peu importe ce paramètre, une fois une occurence trouvée, les textes de tous les champs texte pourront être remplacés.
nl: Gebruik de catalogus om te zoeken, net zoals het zoekformulier doet. Dit vindt alleen woorden, geen html tags. Er kunnen tekstvelden zijn die op deze manier niet gevonden worden, dus als deze optie niet aangevinkt is, zou je meer inhoud kunnen vinden, maar het is langzamer. Ongeacht deze instelling: als minstens één overeenkomst is gevonden in een document, worden alle tekstvelden doorzocht.
ru: Используйте каталог для поиска, так же, как это делает форма поиска. Ищутся только ключевые слова, а не HTML-теги. Вы можете иметь некоторые текстовые поля, которые не нашли этот путь, так что если не установлен, вы можете найти больше содержания, но это будет медленнее. Вне зависимости от этого параметра, когда по крайней мере, найдено одно совпадение, текст во всех текстовых полях может быть заменён.

source: When 'Restrict the enable types' is checked, only the selected types are searched. Otherwise this list is ignored.
fr: Quand 'Restreindre les types activés' est coché, uniquement les types séléctionnés seront recherchés. Sinon, la liste est ignorée.
nl: Als 'Beperkt de ingeschakelde types' is aangevinkt, worden alleen de geselecteerde types doorzocht. Anders wordt deze lijst genegeerd.
ru: Когда 'Ограничиться отмеченными типами.' отмечено, производится поиск только выбранных типов. В противном случае этот список игнорируется.

source: summary_affected_content
fr: Contenu affecté
nl: Te wijzigen inhoud
ru: Затронутое содержимое

source: Filter by fields
fr: Filtrer par champs

source: Reset
fr: Réinitialiser
ru: Сброс

source: collective.searchandreplace
ru: Поиск и Замена (collective.searchandreplace)
